<?php

return [
    'คณะครุศาสตร์' => [
        'การศึกษาปฐมวัย',
        'การประถมศึกษา',
        'ดนตรีศึกษา',
        'คอมพิวเตอร์ศึกษา',
        'วิทยาศาสตร์ทั่วไป',
        'สังคมศึกษา',
        'พลศึกษา',
        'ภาษาไทย',
        'คณิตศาสตร์',
        'เคมี',
        'ภาษาอังกฤษ'
    ],
    'คณะวิทยาศาสตร์และเทคโนโลยี' => [
        'วิทยาการคอมพิวเตอร์',
        'เทคโนโลยีสารสนเทศ',
        'เคมี',
        'ชีววิทยา',
        'วิทยาศาสตร์สิ่งแวดล้อม',
        'คหกรรมศาสตร์',
        'เทคโนโลยีสถาปัตยกรรม',
        'สาธารณสุขศาสตร์',
        'เทคโนโลยีอุตสาหการ'
    ],
    'คณะเทคโนโลยีการเกษตร' => [
        'เทคโนโลยีอาหาร',
        'เทคโนโลยีการประมง',
        'การจัดการทรัพยากรเกษตรเพื่อการท่องเที่ยว',
        'เทคโนโลยีภูมิทัศน์และพืชสวน',
        'เทคโนโลยีการประกอบการธุรกิจอาหาร'
    ],
    'คณะมนุษยศาสตร์และสังคมศาสตร์' => [
        'สารสนเทศศาสตร์และบรรณารักษศาสตร์',
        'ภาษาไทย',
        'การพัฒนาชุมชน',
        'ภาษาจีนเพื่อการสื่อสาร',
        'ภาษาอังกฤษเพื่ออุตสาหกรรมบริการ',
        'ทัศนศิลป์',
        'ศิลปะการจัดการแสดง',
        'นวัตกรรมการออกแบบ',
        'รัฐประศาสนศาสตร์',
        'นิติศาสตร์'
    ],
    'คณะวิทยาการจัดการ' => [
        'การบริหารทรัพยากรมนุษย์',
        'คอมพิวเตอร์ธุรกิจ',
        'การตลาด',
        'การจัดการธุรกิจโรงแรม',
        'การเป็นผู้ประกอบการ',
        'การจัดการนวัตกรรมการบริการ',
        'การจัดการธุรกิจการบิน',
        'การจัดการท่องเที่ยวและบริการ (หลักสูตรภาษาอังกฤษ)',
        'การจัดการท่องเที่ยวทางทะเล',
        'การจัดการท่องเที่ยวและบริการ',
        'นิเทศศาสตร์',
        'การบัญชี',
        'บริหารธุรกิจ (วิชาเอกการจัดการทั่วไป)'
    ]
];
